vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC444_DFP.pdsc
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXC444_system"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXC444_header"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.adc16.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.ak4497.condition_id">
      <require condition="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.cmp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_gpio.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXC444.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="GPIO" Capiversion="1.0.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device_id.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_i2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.i2c, device_id=MCXC444, driver.i2c_dma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.i2c, device_id=MCXC444, driver.i2c_dma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MCXC444.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXC444, device.RTE, device_id=MCXC444, driver.lpuart_dma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXC444, device.RTE, device_id=MCXC444, driver.lpuart_dma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MCXC444.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXC444.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_dma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MCXC444.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_spi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.spi, device_id=MCXC444, driver.spi_dma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.spi, device_id=MCXC444, driver.spi_dma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device_id.MCXC444.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
    </condition>
    <condition id="driver.cmsis_uart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MCXC444, driver.uart_dma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MCXC444, driver.uart_dma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device_id.MCXC444.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_dma"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.cop.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.cs42448.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.cs42448_adapter, driver.codec, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
