vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC444_DFP.pdsc
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.sai.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.sai_dma.condition_id">
      <require condition="allOf.driver.dma, driver.sai, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.sai, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.sim.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.slcd.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.slcd_engine.condition_id">
      <require condition="allOf.anyOf=driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010, device=MCXC444.internal_condition">
      <require condition="anyOf.driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010.internal_condition"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.slcd_ftp12557, driver.slcd_gdh_1247wp, driver.slcd_lcd_s401m16kr, driver.slcd_od_6010.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_ftp12557"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_gdh_1247wp"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_lcd_s401m16kr"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_od_6010"/>
    </condition>
    <condition id="driver.slcd_ftp12557.condition_id">
      <require condition="allOf.driver.slcd_engine, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.driver.slcd_engine, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_engine"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.slcd_gdh_1247wp.condition_id">
      <require condition="allOf.driver.slcd_engine, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.slcd_lcd_s401m16kr.condition_id">
      <require condition="allOf.driver.slcd_engine, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.slcd_od_6010.condition_id">
      <require condition="allOf.driver.slcd_engine, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.smc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.spi.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.spi_dma.condition_id">
      <require condition="allOf.driver.dma, driver.spi, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.spi, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.tfa9896.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9896_adapter, driver.codec, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9896_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.tfa9xxx_adapter, driver.codec, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.tfa9xxx_hal.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MCXC444.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, driver.codec, driver.tfa9xxx, device=MCXC444.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tfa9xxx"/>
      <require condition="device.MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.tma525b.condition_id">
      <require condition="allOf.device=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.tpm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXC444.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.i2c, driver.common, device=MCXC444.internal_condition"/>
    </condition>
