vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC444_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXC444_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXC444_cmsis</description>
      <files>
        <file category="header" name="devices/MCXC444/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXC444/MCXC444.h" projectpath="device"/>
        <file category="header" name="devices/MCXC444/MCXC444_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXC444/MCXC444_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_CMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_DAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_DMAMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_FGPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_FTFA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_I2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_I2S.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_LLWU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_MCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_MCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_MTB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_MTBDWT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_NV.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_OSC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_PIT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_PMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_RCM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_RFSYS.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_ROM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_SIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_SMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_SPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_TPM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_UART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXC444/periph2/PERI_VREF.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXC444/"/>
        <file category="include" name="devices/MCXC444/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC444/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC444/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXC444_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXC444_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC444.condition_id" category="linkerScript" attr="config" name="devices/MCXC444/arm/MCXC444_flash.scf" version="1.0.0" projectpath="MCXC444/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXC444.condition_id" category="linkerScript" attr="config" name="devices/MCXC444/arm/MCXC444_ram.scf" version="1.0.0" projectpath="MCXC444/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC444.condition_id" category="linkerScript" attr="config" name="devices/MCXC444/gcc/MCXC444_flash.ld" version="1.0.0" projectpath="MCXC444/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXC444.condition_id" category="linkerScript" attr="config" name="devices/MCXC444/gcc/MCXC444_ram.ld" version="1.0.0" projectpath="MCXC444/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC444.condition_id" category="linkerScript" attr="config" name="devices/MCXC444/iar/MCXC444_flash.icf" version="1.0.0" projectpath="MCXC444/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXC444.condition_id" category="linkerScript" attr="config" name="devices/MCXC444/iar/MCXC444_ram.icf" version="1.0.0" projectpath="MCXC444/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXC444" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXC444</description>
      <files>
        <file category="header" attr="config" name="devices/MCXC444/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC444/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC444/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC444/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC444/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC444/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXC444/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXC444/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXC444/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXC444_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXC444/iar/startup_MCXC444.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXC444/gcc/startup_MCXC444.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXC444/arm/startup_MCXC444.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXC444_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXC444_system</description>
      <files>
        <file category="sourceC" name="devices/MCXC444/system_MCXC444.c" projectpath="device"/>
        <file category="header" name="devices/MCXC444/system_MCXC444.h" projectpath="device"/>
        <file category="include" name="devices/MCXC444/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.3.0" condition="driver.adc16.condition_id">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC444/drivers/fsl_adc16.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC444/drivers/fsl_adc16.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC444/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
