vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC444_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rcm" Cversion="2.0.4" condition="driver.rcm.condition_id">
      <description>RCM Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC444/drivers/fsl_rcm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC444/drivers/fsl_rcm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC444/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc" Cversion="2.4.0" condition="driver.rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXC444/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXC444/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXC444/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.8" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MCXC444/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC444/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC444/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_dma" Cversion="2.4.0" condition="driver.sai_dma.condition_id">
      <description>SAI DMA Driver</description>
      <files>
        <file category="header" name="devices/MCXC444/drivers/fsl_sai_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC444/drivers/fsl_sai_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC444/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sim" Cversion="2.2.0" condition="driver.sim.condition_id">
      <description>SIM Driver</description>
      <files>
        <file category="header" name="devices/MCXC444/drivers/fsl_sim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC444/drivers/fsl_sim.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC444/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd" Cversion="2.1.0" condition="driver.slcd.condition_id">
      <description>SLCD Driver</description>
      <files>
        <file category="header" name="devices/MCXC444/drivers/fsl_slcd.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXC444/drivers/fsl_slcd.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXC444/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_engine" Cversion="1.0.2" condition="driver.slcd_engine.condition_id">
      <description>Driver slcd_engine</description>
      <files>
        <file category="sourceC" name="components/slcd_engine/slcd_engine.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/slcd_engine.h" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/slcd_panel.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/"/>
      </files>
    </component>
